src/templateCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    front
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    cylinderGroup
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
}



// ************************************************************************* //
