src/templateCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    top
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    back
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    front
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    cylinderGroup
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}



// ************************************************************************* //
