src/templateCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12                                	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

xmin -8.0;
xmax  20.0;
ymin -7.0;
ymax  7.0;
zmin -7.0;
zmax  7.0;

//xcells 30;
//ycells 20;
//zcells 20;

dx 0.5;
dy 0.5;
dz 0.5;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

xcells #calc "abs(($lx)/($dx))";
ycells #calc "abs(($ly)/($dy))";
zcells #calc "abs(($lz)/($dz))";

vertices        
(
    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);


blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);


edges           
(
);


boundary        
(
    inlet
    {
        type patch;
    	faces
    	( 
                (0 4 7 3)
    	);
    }

    outlet
    {
        type patch;
    	faces
    	( 
                (2 6 5 1)
    	);
    }

    bottom
    {
        type patch;
    	faces
    	( 
                (1 5 4 0)
    	);
    }

    top
    {
        type patch;
    	faces
    	( 
                (3 7 6 2)
    	);
    }

    back
    {
        type patch;
    	faces
    	( 
                (0 3 2 1)
    	);
    }

    front
    {
        type patch;
    	faces
    	( 
                (4 5 6 7)
    	);
    }

);


mergePatchPairs 
(
);

// ************************************************************************* //
