src/templateCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;
    //grad(U)         Gauss linear;

    default         cellLimited Gauss linear 0.5;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss linear;
    //div(phi,U)      bounded Gauss limitedLinearV 1;
    //div(phi,U)      Gauss upwind;

    //div(phi,k) Gauss linearUpwind grad(k);
    //div(phi,omega) Gauss linearUpwind grad(omega);

    div(phi,k) 		bounded Gauss upwind;
    div(phi,omega) 	bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
      default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method	    meshWave;

/*
Poisson
advectionDiffusion
meshWave
*/
}


// ************************************************************************* //
