src/templateCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	minIter		 3;
    }

    U
    {
        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //tolerance        1e-8;
        //relTol           0.0;
        //nSweeps          1;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    k
    {
        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //tolerance        1e-8;
        //relTol           0.0;
        //nSweeps          1;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    omega
    {
        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //tolerance        1e-8;
        //relTol           0.0;
        //nSweeps          1;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    consistent on;

    residualControl
    {
        p               1e-3;
        U               1e-3;
        nuTilda         1e-3;
        k               1e-3;
        omega           1e-3;
    }
}

/*
//SIMPLE with default URF diverges at one point early in the simulation
relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
	nut		0.7;
    }
}
*/

//SIMPLEC URF
relaxationFactors
{
    fields
    {
        p               0.7;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}


// ************************************************************************* //
